# Group 10
 
## Group Members: Ilia, Mai, Martin, Ryan

_______________________________________________________________________________________________________________________________

# Overview

Our group is using pandas to import two datasets to clean and transform them before loading them into PostgresSQL. The two datasets are a csv files from Kaggle, one is drinks.csv and the second one is unemployment analysis.csv. 

Since the data for drinks.csv is for the year 2010, we decided to clean the Unemployment Analysis.csv and select picked the year 2010. then merged the two datasets together to form the new dataframe. Both datasets showed 153 countries on alcohol consumption and unemployment rate.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

# Extract

Our group imported two csv data, drinks.csv, and unemployment analysis.csv to use for this project. The two datasets were stored in our repository in the folder name data.

In [2]:
# Store file path in a variable
drinks = "data/drinks.csv"
unemployment = "data/unemployment analysis.csv"

In [3]:
# Read our Data file with pandas library
drinks_df = pd.read_csv(drinks)
unemployment_df = pd.read_csv(unemployment)

In [4]:
# Show Drinks dataframe
drinks_df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [5]:
# Show unemployment dataframe
unemployment_df.rename(columns={'Country Name':'country'}, inplace=True)

In [6]:
# Reference multiple columns within a dataframe
cleaned_unemployment_df = unemployment_df[['country', 'Country Code', '2010']]

In [7]:
# Show Cleaned Unemployment dataframe
cleaned_unemployment_df

                         country Country Code   2010
0    Africa Eastern and Southern          AFE   6.87
1                    Afghanistan          AFG  11.35
2     Africa Western and Central          AFW   4.55
3                         Angola          AGO   9.43
4                        Albania          ALB  14.09
..                           ...          ...    ...
230                        Samoa          WSM   5.73
231                  Yemen, Rep.          YEM  12.83
232                 South Africa          ZAF  24.68
233                       Zambia          ZMB  13.19
234                     Zimbabwe          ZWE   5.21

[235 rows x 3 columns]

In [8]:
# Merge the Drinks and unemployment dataframes
cleaned_df = drinks_df.merge(cleaned_unemployment_df, how='inner', on='country')

In [9]:
cleaned_df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,Country Code,2010
0,Afghanistan,0,0,0,0.0,AFG,11.35
1,Albania,89,132,54,4.9,ALB,14.09
2,Algeria,25,0,14,0.7,DZA,9.96
3,Angola,217,57,45,5.9,AGO,9.43
4,Argentina,193,25,221,8.3,ARG,7.71
...,...,...,...,...,...,...,...
149,Uzbekistan,25,101,8,2.4,UZB,5.40
150,Vanuatu,21,18,11,0.9,VUT,1.85
151,Vietnam,111,2,1,2.0,VNM,1.11
152,Zambia,32,19,4,2.5,ZMB,13.19
153,Zimbabwe,64,18,4,4.7,ZWE,5.21